/**
 * 1995 онд Javascript хэлийн Brenden Eich 10 хоногт бүтээсэн.
 * Ecmascript 1 стандарт 1997 онд гарсан байна. 
 * 2019 оны 6 сард ES10 гарсан 
 * ES.NEXT гэж ирээдүйн хувилбарыг кодолж ярьдаг 
 * 
 * ES5 - 2009 
 * ES5 - хувилбар бол одоогийн бүх броузерууд дээр 100% дэмжигддэг
 * хувилбар юм. 
 * 
 * ES2019, 2018, 2017 хувилбарууд 
 * Орчин үеийн жаваскрипт ашиглаж бичихэд броузерууд дээр ажиллахгүй. 
 * Энэ асуудлыг javascript compiler ашиглаж шийддэг. 
 * Хамгийн алдартай compiler Babel 
 * Орчин үеийн жаваскриптээр бичсэн кодыг ES5-ийн код руу хөрвүүлдэг байгаа.
 * 
 * Өмнөх ES хувилбаруудыг сурах шаардлага юу байна? 
 * 
 * 1. Та ажил дээр гарахаар янз бүрийн хувилбар холин бичигдсэн олон 
 * төслүүд дээр ажиллах болно. 
 * 
 * 2. Мөн интернэтэд байдаг олон чухал library мөн өмнөх 
 * хувилбараар бичигдсэн байдаг npmjs
 * 
 * 3. Интернэтэд байгаа ихэнх гайхалтай жишээнүүд өмнөх 
 * хувилбарууд дээр бичигдсэн байдаг. 
 * 
 * 
 * Lesson Tracking 
 * 
 * Lesson 83. let, const ашиглан хувьсагч зарлах 
 * 
 */

 /**
  * const - constant never changed
  * let - зөвхөн тухайн scope дотроо ажилладаг
  * хувьсагч 
  */

  /**
   * var нь бол блокоос гадуур ажилладаг. 
   */

   /**
    * const, let - ээр хувьсагч зарлах нь тухайн
    * програмистын шийдвэрээс хамаарна. 
    */